/***************************************************************************/
// 程序：清洗设备控制器
// 模块：参数
// 文件：parameter.c
// 作者：卜晓旸
// 版本：V0.02
// 日期：2013年11月8日
// 功能：参数
// 芯片：STC12C5A60S2
// 编译：Keil uVision3 V3.90
/***************************************************************************/

#include <parameter.h>
#include <eeprom.h>


/***************************************************************************/
// 参数初始化函数
// 参数：无
// 返回值：无	
/***************************************************************************/
void IO_init()
{
	DoorOpen = 0;             //激活卷门开门输出         Y0
	DoorClose = 0;            //激活卷门关门输出         Y1
	DoorFloor1 = 0;         //一楼卷门激活             Y2
	DoorFloor2 = 0;	          //二楼卷门激活             Y3
	BoxUp   = 0;              //油泵电梯轿厢向上推       Y4
	BoxDown = 0;              //油泵电梯轿厢向下推       Y5
	
	if(sensorFloor1)
	{
		ledDS151  = 1;            //电梯指示灯1              Y6
	}
	else
	{
		ledDS151  = 0;	
	}
	
	if(sensorFloor2)
	{
		ledDS152 = 1;             //电梯指示灯2              Y7
	}
	else
	{
		ledDS152 = 0;
	}
	ledS  = 0;                //指示灯 箭头向上      	 Y10
	ledX = 0;                 //指示灯 箭头向下	     	 Y11
	Led601  = 0;              //指示灯按钮①             Y12
	Led602 = 0;               //指示灯按钮②             Y13
}



